# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

my_dict = {}

with open('education.txt', encoding='UTF-8') as education:
    for line in education:
        line = line.replace('-', '').replace(':', '').replace('(л)', '').replace('(пр)', '').replace('(лаб)', '')
        my_dict[line.split()[0]] = sum(map(int, line.split()[1:]))
    print(my_dict)




